bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32H742x.svd
        <register>
          <name>WPSN_PRG2R</name>
          <displayName>WPSN_PRG2R</displayName>
          <description>FLASH write sector protection for bank
          2</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRPSn2</name>
              <description>Bank 2 sector write protection
              configuration byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCR2</name>
          <displayName>CRCCR2</displayName>
          <description>FLASH CRC control register for bank
          1</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_SECT</name>
              <description>Bank 2 CRC sector number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ALL_BANK</name>
              <description>Bank 2 CRC select bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_BY_SECT</name>
              <description>Bank 2 CRC sector mode select
              bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADD_SECT</name>
              <description>Bank 2 CRC sector select
              bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAN_SECT</name>
              <description>Bank 2 CRC sector list clear
              bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START_CRC</name>
              <description>Bank 2 CRC start bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAN_CRC</name>
              <description>Bank 2 CRC clear bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_BURST</name>
              <description>Bank 2 CRC burst size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCSADD2R</name>
          <displayName>CRCSADD2R</displayName>
          <description>FLASH CRC start address register for bank
          2</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_START_ADDR</name>
              <description>CRC start address on bank
              2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCEADD2R</name>
          <displayName>CRCEADD2R</displayName>
          <description>FLASH CRC end address register for bank
          2</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_END_ADDR</name>
              <description>CRC end address on bank 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_FA2R</name>
          <displayName>ECC_FA2R</displayName>
          <description>FLASH ECC fail address for bank
          2</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FAIL_ECC_ADDR2</name>
              <description>Bank 2 ECC error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AXI</name>
      <description>AXI interconnect registers</description>
      <groupName>AXI</groupName>
      <baseAddress>0x51000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AXI_PERIPH_ID_4</name>
          <displayName>AXI_PERIPH_ID_4</displayName>
          <description>AXI interconnect - peripheral ID4
          register</description>
          <addressOffset>0x1FD0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>JEP106CON</name>
              <description>JEP106 continuation code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>KCOUNT4</name>
              <description>Register file size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERIPH_ID_0</name>
          <displayName>AXI_PERIPH_ID_0</displayName>
          <description>AXI interconnect - peripheral ID0
          register</description>
          <addressOffset>0x1FE0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PARTNUM</name>
              <description>Peripheral part number bits 0 to
              7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERIPH_ID_1</name>
          <displayName>AXI_PERIPH_ID_1</displayName>
          <description>AXI interconnect - peripheral ID1
          register</description>
          <addressOffset>0x1FE4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PARTNUM</name>
              <description>Peripheral part number bits 8 to
              11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>JEP106I</name>
              <description>JEP106 identity bits 0 to
              3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERIPH_ID_2</name>
          <displayName>AXI_PERIPH_ID_2</displayName>
          <description>AXI interconnect - peripheral ID2
          register</description>
          <addressOffset>0x1FE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>JEP106ID</name>
              <description>JEP106 Identity bits 4 to
              6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>JEDEC</name>
              <description>JEP106 code flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REVISION</name>
              <description>Peripheral revision number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERIPH_ID_3</name>
          <displayName>AXI_PERIPH_ID_3</displayName>
          <description>AXI interconnect - peripheral ID3
          register</description>
          <addressOffset>0x1FEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>CUST_MOD_NUM</name>
              <description>Customer modification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REV_AND</name>
              <description>Customer version</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_COMP_ID_0</name>
          <displayName>AXI_COMP_ID_0</displayName>
          <description>AXI interconnect - component ID0
          register</description>
          <addressOffset>0x1FF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Preamble bits 0 to 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_COMP_ID_1</name>
          <displayName>AXI_COMP_ID_1</displayName>
          <description>AXI interconnect - component ID1
          register</description>
          <addressOffset>0x1FF4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Preamble bits 8 to 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLASS</name>
              <description>Component class</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_COMP_ID_2</name>
          <displayName>AXI_COMP_ID_2</displayName>
          <description>AXI interconnect - component ID2
          register</description>
          <addressOffset>0x1FF8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Preamble bits 12 to 19</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_COMP_ID_3</name>
          <displayName>AXI_COMP_ID_3</displayName>
          <description>AXI interconnect - component ID3
          register</description>
          <addressOffset>0x1FFC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Preamble bits 20 to 27</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG1_FN_MOD_ISS_BM</displayName>
          <description>AXI interconnect - TARG x bus matrix issuing
          functionality register</description>
          <addressOffset>0x2008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Switch matrix write issuing override for
              target</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG2_FN_MOD_ISS_BM</displayName>
          <description>AXI interconnect - TARG x bus matrix issuing
          functionality register</description>
          <addressOffset>0x3008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Switch matrix write issuing override for
              target</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG3_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG3_FN_MOD_ISS_BM</displayName>
          <description>AXI interconnect - TARG x bus matrix issuing
          functionality register</description>
          <addressOffset>0x4008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Switch matrix write issuing override for
              target</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG4_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG4_FN_MOD_ISS_BM</displayName>
          <description>AXI interconnect - TARG x bus matrix issuing
          functionality register</description>
          <addressOffset>0x5008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Switch matrix write issuing override for
              target</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG5_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG5_FN_MOD_ISS_BM</displayName>
          <description>AXI interconnect - TARG x bus matrix issuing
          functionality register</description>
          <addressOffset>0x6008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Switch matrix write issuing override for
              target</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG6_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG6_FN_MOD_ISS_BM</displayName>
          <description>AXI interconnect - TARG x bus matrix issuing
          functionality register</description>
          <addressOffset>0x7008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Switch matrix write issuing override for
              target</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD_ISS_BM</name>
          <displayName>AXI_TARG7_FN_MOD_ISS_BM</displayName>
          <description>AXI interconnect - TARG x bus matrix issuing
          functionality register</description>
          <addressOffset>0x800C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Switch matrix write issuing override for
              target</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD2</name>
          <displayName>AXI_TARG1_FN_MOD2</displayName>
          <description>AXI interconnect - TARG x bus matrix
          functionality 2 register</description>
          <addressOffset>0x2024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>Disable packing of beats to match the
              output data width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD2</name>
          <displayName>AXI_TARG2_FN_MOD2</displayName>
          <description>AXI interconnect - TARG x bus matrix
          functionality 2 register</description>
          <addressOffset>0x3024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>Disable packing of beats to match the
              output data width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG7_FN_MOD2</name>
          <displayName>AXI_TARG7_FN_MOD2</displayName>
          <description>AXI interconnect - TARG x bus matrix
          functionality 2 register</description>
          <addressOffset>0x8024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>Disable packing of beats to match the
              output data width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD_LB</name>
          <displayName>AXI_TARG1_FN_MOD_LB</displayName>
          <description>AXI interconnect - TARG x long burst
          functionality modification</description>
          <addressOffset>0x202C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>FN_MOD_LB</name>
              <description>Controls burst breaking of long
              bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG2_FN_MOD_LB</name>
          <displayName>AXI_TARG2_FN_MOD_LB</displayName>
          <description>AXI interconnect - TARG x long burst
          functionality modification</description>
          <addressOffset>0x302C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>FN_MOD_LB</name>
              <description>Controls burst breaking of long
              bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_TARG1_FN_MOD</name>
          <displayName>AXI_TARG1_FN_MOD</displayName>
          <description>AXI interconnect - TARG x long burst
          functionality modification</description>
          <addressOffset>0x2108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>Override AMIB read issuing
              capability</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Override AMIB write issuing
              capability</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
